[
  {
    "name": "ember-finance",
    "title": "Ember Finance",
    "website": "https://ember.finance",
    "tags": ["Brand Design", "UI/UX", "TailwindCSS", "React"],
    "text": [
      {
        "title": "The Challenge",
        "paragraphs": [
          "The Ember team embarked on a mission to revamp the process of token creation, while introducing an innovative feature: Liquidity as a Service (LaaS). It aimed to provide users with the ability to get liquidity for newly created tokens, all within a simplified and highly customizable user experience. The goal was clear: streamline the token creation process."
        ]
      },
      {
        "title": "The Solution",
        "paragraphs": [
          "To achieve this goal of simplicity, I started by designing a user flow centered around a token creation function, and by a user-friendly landing page. Although our primary focus was on creating a familiar user experience, we experimented with innovative designs too.",
          "For our color scheme, we went with vibrant tones of orange and yellow, in order to represent what the Ember logo actually was. On the other hand, our UX design choices were based on studying other successful dApps —I conducted evaluations and added improvements to ensure that users could effortlessly navigate our platform.",
          "On the frontend, we chose Tailwind for its scalability, and React. Overall, the decision-making process was collaborative: I also had to expose different alternatives to address the same issue.",
          "With the foundational elements in place, I shifted my focus towards refining the user interface, while the rest of the team dedicated their efforts to building the needed smart contracts required for LaaS and other functionalities."
        ]
      },
      {
        "title": "Conclusion",
        "paragraphs": [
          "Ember has now become a more stable product, transitioning into a maintenance phase. While the path presented its challenges, we've always prioritized simplicity."
        ]
      }
    ]
  },
  {
    "name": "phantazm",
    "title": "Phantazm",
    "website": "https://app.phantazm.com",
    "tags": ["UI/UX", "TailwindCSS", "TypeScript", "NextJS"],
    "text": [
      {
        "title": "The Challenge",
        "paragraphs": [
          "Many lending plaforms in the crypto space already exist, but none on zkEVM — a chain built on Polygon. And since the main selling point of Phantazm is the fact it has no chain competitors, the focus on the UI/UX was directed towards maximum familiarity, while correcting and putting together other pieces from peer dApps."
        ]
      },
      {
        "title": "The Solution",
        "paragraphs": [
          "The logo and brand colors were already made by the team’s graphic designer, leaving little for me to contribute in that regard. I didn’t have to do much creative work either: the initial version didn’t even have a landing page. That way, I had more time to think about how forms and other key elements should be displayed so it could all come together.",
          "After having a user dashboard page, and another one to list all the lending markets fully designed and prototyped, it was time to move onto coding. For our tech stack, the team unanimously decided on Next.js, coupled with TypeScript and Tailwind. At the time, TS was new to me, so I got to experiment a good part of its core features.",
          "Upon completing the development of all necessary state management, integration of charts using apex-charts, and other essential features, the only piece left was pulling real data from Subgraph (in which I was involved on the sidelines)."
        ]
      },
      {
        "title": "Conclusion",
        "paragraphs": [
          "Phantazm is currently close to being launched on testnets, while the backend developers do their best to finish integrating my work. "
        ]
      }
    ]
  },
  {
    "name": "blurt",
    "title": "Powerpush/Blurt",
    "website": "https://ethglobal.com/showcase/power-push-5y93i",
    "tags": ["Brand Design", "UI/UX", "TailwindCSS", "React"],
    "text": [
      {
        "title": "The Challenge",
        "paragraphs": [
          "Blurt, originally named PowerPush, is a result of a hackathon entry (organized by ETHGlobal, Scaling Ethereum 2023). From all the partner dApps giving away prize pools, my team chose Push.org —a chat service that can be used between wallets —and planned to build on top of it an entire social experience."
        ]
      },
      {
        "title": "The Solution",
        "paragraphs": [
          "This social experience would first include a feature to send and receive money between the wallets starting a chat —similar to Apple Pay in iMessage, for instance. Later on, it would also include group chats, designed for DAOs, and a global feed.",
          "I was highly focused on the design, but at the same time we only had two weeks to work on our MVP. To give a better image of the product I was centered on the more aesthetic part: mockups (and slides).",
          "This gave me issues related to resposivity and ability to fit everything in mobile sizes. Anyway, by the time we had to present our project, we had most of the MVP finished, while the issues on my end were irrelevant for that time."
        ]
      },
      {
        "title": "Conclusion",
        "paragraphs": [
          "We got pool prizes for both Push and Across, and more information about the project (specifically about features and architecture) can be found at the project’s website. At the moment, we’re planning to receive more funding from Push."
        ]
      }
    ]
  },
  {
    "name": "mktsuite",
    "title": "MktSuite",
    "website": "https://mktclock.com",
    "tags": ["Brand Design", "UI/UX", "TailwindCSS", "React"],
    "text": [
      {
        "title": "The Challenge",
        "paragraphs": [
          "MktSuite is being built on the principle of seeking for tools for traders around all markets — especially in the field of aggregating different types of information from multiple sources. Most of the already existing services either have a poor UI/UX, or are rather unknown."
        ]
      },
      {
        "title": "The Solution",
        "paragraphs": [
          "When asking around for user needs, I got a quite interesting reply, that I personally hadn’t seen anywhere: a page that shows statuses of stock exchanges around the world and their open time converted to user local time. Since it was a simple concept, I decided to make the entire thing open-source.",
          "The design process was straightforward —I was aiming for maximum minimalism in order to let the user access the information as soon as they visited the website— although I still had to make sure everything else was in balance.",
          "I went for the frontend architecture I was already comfortable with: React and Tailwind. There were no significant blockers, but a handful of edge cases to take into account. "
        ]
      },
      {
        "title": "Conclusion",
        "paragraphs": [
          "But launching MktClock was not the end of the story: there are still many gaps to fill, and there will be more additions in the following months to shape this project and give it this “suite” form."
        ]
      }
    ]
  }
]
